// supportData.ts

export const supportData = [
  {
    title: "Часто задаваемые вопросы",
    subtitle:
      "Вот некоторые из наиболее распространенных вопросов, которые задают наши пользователи",
    cards: [
      {
        title: "Как настроить имеющееся у меня оборудование?",
        content:
          "Чтобы установить оборудование, к которому у вас есть доступ, просто перейдите в раздел «Оборудование» на странице вашего профиля, установите флажок напротив имеющегося у вас оборудования, а затем нажмите кнопку «Сохранить».",
      },
      {
        title: "Как обновить свою личную информацию?",
        content:
          "Чтобы обновить личную информацию, просто перейдите в раздел «Подробности» на странице вашего профиля, а затем обновите информацию по мере необходимости. Не забудьте нажать кнопку «Сохранить», когда закончите!",
      },
      {
        title: "Как отфильтровать список упражнений на странице «Упражнения»?",
        content:
          "Чтобы отфильтровать список упражнений, просто нажмите кнопку «Фильтр» в верхней части страницы, а затем выберите фильтры, которые вы хотите применить. Вы можете фильтровать по группам мышц, оборудованию и т. д.! Фильтры будут сохранены в url, так что вы сможете легко поделиться отфильтрованным списком с другими.",
      },
      {
        title:
          "Как я могу поместить упражнения в избранное, чтобы потом легко их находить?\n",
        content:
          "Чтобы отметить упражнение, просто нажмите на значок звезды рядом с упражнением, которое вы хотите отметить. Затем вы можете просмотреть все понравившиеся упражнения на странице «Упражнения», нажав кнопку фильтров и выбрав «Мои любимые».",
      },
      {
        title: "Как создать программу тренировок?",
        content:
          "Существует два способа создания рутин: 1. Вы можете создать программу с нуля, перейдя на страницу «Начало тренировки» и нажав кнопку «Создать программу». 2. Вы можете создать рутину на странице Browse Exercises, нажав на значок «плюс» рядом с каждым упражнением.",
      },
    ],
  },
  // {
  //     title: "Troubleshooting",
  //     subtitle: "Having trouble with the app? Here are some common issues and how to fix them.",
  //     cards: [
  //         {
  //             title: "The app is not tracking my workouts correctly.",
  //             content: "If you're having trouble with the workout tracking feature, make sure that you have granted the app permission to access your device's GPS or motion sensors. You may also need to enable location services on your phone to ensure accurate tracking."
  //         },
  //     ]
  // },
];
